[
{ "cve": "CVE-2022-1245",
  "date": "07/07/2022",
  "message": "A privilege escalation flaw was found in the token exchange feature of keycloak. Missing authorization allows a client application holding a valid access token to exchange tokens for any target client by passing the client_id of the target. This could allow a client to gain unauthorized access to additional services.",
  "solution": "Update to version 18.0.0",
  "good_version": "18.0.0",
  "url": "",
  "variable":[],
  "severity": "9.8"
},
  { "cve": "CVE-2022-3782",
  "date": "01/13/2023",
  "message": "Keycloak: path traversal via double URL encoding. A flaw was found in Keycloak, where it does not properly validate URLs included in a redirect. An attacker can use this flaw to construct a malicious request to bypass validation and access other URLs and potentially sensitive information within the domain or possibly conduct further attacks. This flaw affects any client that utilizes a wildcard in the Valid Redirect URIs field.",
  "solution": "Remove wildcard from redirect URI's or update version to 20.0.2",
  "good_version": "20.0.2",
  "url": "admin/realms/master/clients",
  "variable":["redirectUris"],
  "severity": "9.1"
},
   { "cve": "CVE-2020-1717",
  "date": "02/11/2021",
  "message": "A logged in user can do an account email enumeration attack.",
  "solution": "Disable clients account-console/account or upgrade version",
  "good_version": "7.0.1",
  "url": "admin/realms/master/clients",
  "variable":["account-console","account"],
  "severity": "2.7"
},
     { "cve": "CVE-2021-3754",
  "date": "02/11/2021",
  "message": "A flaw was found in keycloak where an attacker is able to register himself with the username same as the email ID of any existing user. This may cause trouble in getting password recovery email in case the user forgets the password.",
  "solution": "Enable email_as_an_user or update version",
  "good_version": "19.0.2",
  "url": "admin/realms/master",
  "variable": ["registrationEmailAsUsername","loginWithEmailAllowed"],
  "severity": "5.3"
},
  { "cve": "CVE-2021-3827",
  "date": "08/23/2022",
  "message": "A flaw was found in keycloak, where the default ECP binding flow allows other authentication flows to be bypassed. By exploiting this behavior, an attacker can bypass the MFA authentication by sending a SOAP request with an AuthnRequest and Authorization header with the user's credentials. The highest threat from this vulnerability is to confidentiality and integrity.",
  "solution": "Update version",
  "good_version": "18.0.0",
  "url": "",
  "variable": [],
  "severity": "6.8"
},
  { "cve": "CVE-2021-20323",
  "date": "03/25/2022",
  "message": "The clients-registrations endpoint allows execution of javascript code on the client-side, which makes it vulnerable to a Cross-Site Scripting attack.",
  "solution": "Update version, put in place a reverse proxy to forbid any call to clients-registrations or configure Keycloak with ACL to limit access to clients-registrations",
  "good_version": "18.0.0",
  "url": "",
  "variable": [],
  "severity": "6.1"
},
  { "cve": "CVE-2021-4133",
  "date": "01/25/2022",
  "message": "A flaw was found in Keycloak in versions from 12.0.0 and before 15.1.1 which allows an attacker with any existing user account to create new default user accounts via the administrative REST API even when new user registration is disabled.",
  "solution": "Update version, or add an expression rejecting REST requests from other domains",
  "good_version": "16.0.0",
  "url": "",
  "variable": [],
  "severity": "8.8"
},
  { "cve": "CVE-2022-1274",
  "date": "01/25/2022",
  "message": "A flaw was found in Keycloak in the execute-actions-email endpoint. This issue allows arbitrary HTML to be injected into emails sent to Keycloak users and can be misused to perform phishing or other attacks against users.",
  "solution": "Update version",
  "good_version": "20.0.5",
  "url": "",
  "variable": [],
  "severity": "5.4"
},
  { "cve": "CVE-2021-3632",
  "date": "08/26/2022",
  "message": "This vulnerability allows anyone to register a new security device or key when there is not a device already registered for any user by using the WebAuthn password-less login flow.",
  "solution": "Update version",
  "good_version": "20.0.5",
  "url": "",
  "variable": [],
  "severity": "7.5"
},
  { "cve": "CVE-2021-3856",
  "date": "08/26/2022",
  "message": "ClassLoaderTheme and ClasspathThemeResourceProviderFactory allows reading any file available as a resource to the classloader. By sending requests for theme resources with a relative path from an external HTTP client, the client will receive the content of random files if available.",
  "solution": "Update version",
  "good_version": "15.1.0",
  "url": "",
  "variable": [],
  "severity": "4.3"
},
  { "cve": "CVE-2022-0225",
  "date": "08/26/2022",
  "message": "This flaw allows a privileged attacker to use the malicious payload as the group name while creating a new group from the admin console, leading to a stored Cross-site scripting (XSS) attack.",
  "solution": "Update version",
  "good_version": "16.0.1",
  "url": "",
  "variable": [],
  "severity": "5.4"
},
  { "cve": "CVE-2020-10734",
  "date": "02/11/2021",
  "message": "A vulnerability was found in keycloak in the way that the OIDC logout endpoint does not have CSRF protection.",
  "solution": "Update version",
  "good_version": "18.0.0",
  "url": "",
  "variable": [],
  "severity": "3.3"
},
  { "cve": "CVE-2023-0091",
  "date": "01/13/2023",
  "message": "A flaw was found in Keycloak, where it did not properly check client tokens for possible revocation in its client credential flow. This flaw allows an attacker to access or modify potentially sensitive information.",
  "solution": "Update version",
  "good_version": "20.0.3",
  "url": "",
  "variable": [],
  "severity": "3.8"
},
  { "cve": "CVE-2022-2256",
  "date": "09/01/2022",
  "message": "A Stored Cross-site scripting (XSS) vulnerability was found in keycloak as shipped in Red Hat Single Sign-On 7. This flaw allows a privileged attacker to execute malicious scripts in the admin console, abusing the default roles functionality.",
  "solution": "Update version",
  "good_version": "19.0.2",
  "url": "",
  "variable": [],
  "severity": "3.8"
},
  { "cve": "CVE-2022-2237",
  "date": "03/27/2023",
  "message": "A flaw was found in the Keycloak Node.js Adapter. This flaw allows an attacker to benefit from an Open Redirect vulnerability in the checkSso function.",
  "solution": "Update version",
  "good_version": "21.0.1",
  "url": "",
  "variable": [],
  "severity": "6.1"
},
  { "cve": "CVE-2022-2668",
  "date": "08/05/2022",
  "message": "An issue was discovered in Keycloak that allows arbitrary Javascript to be uploaded for the SAML protocol mapper even if the UPLOAD_SCRIPTS feature is disabled",
  "solution": "Update version",
  "good_version": "19.0.2",
  "url": "",
  "variable": [],
  "severity": "7.2"
}]